Сюжет игры Чәчәк Quest:

Сцена 1(ходим):
      Объекты: фон, дома, бабай(подсвечивается), эби, цветок, колодец, чиләк
      взаимодействуем с бабаем -> сцена 2

Сцена 2(болтаем):
      Объекты: объекты сцены 1 на фоне(затемнено), большой бабай слева, текстовое окно ("Сәлам!")
      взаимодействуем с текстовым окном -> сцена 3

Сцена 3(ходим):
      Объекты: фон, дома, бабай, эби(подсвечивается), цветок, колодец, чиләк
      взаимодействуем с эби -> сцена 4

Сцена 4(болтаем):
      Объекты: объекты сцены 3 на фоне(затемнено), большая эби слева, текстовое окно ("Исәнмесез, бир миңа чәчәк")
      взаимодействуем с текстовым окном -> сцена 5

Сцена 5(ходим):
      Объекты: фон, дома, бабай, эби, цветок(подсвечивается), колодец, чиләк
      взаимодействуем с цветком -> сцена 6

Сцена 6(болтаем):
      Объекты: объекты сцены 5 на фоне(затемнено), большой цветок, текстовое окно ("Чәчәк")
      взаимодействуем с текстовым окном -> сцена 7

Сцена 7(ходим):
      Объекты: фон, дома, бабай, эби(подсвечивается), цветок, колодец, чиләк
      взаимодействуем с эби -> сцена 8

Сцена 8(болтаем):
    Объекты: объекты сцены 7 на фоне(затемнено), большая эби слева, текстовое окно ("Рәхмәт")
    взаимодействуем с текстовым окном -> сцена 9

Сцена 9(ходим):
      Объекты: фон с домом, бабай, эби, колодец слева, су справа от бабая, дверь (ишек, подсвечивается)
      взаимодействуем с дверью -> сцена 10

Сцена 10(болтаем):
      Объекты: затемнённый фон сцены 9 с колодцем и су, крупная дверь слева, текстовое окно ("Ишек"), реплика эби «Өйгә рәхим ит!»
      взаимодействуем с текстовым окном -> сцена 11

Сцена 11(ходим):
      Объекты: интерьер дома, дверь слева сверху, самавыр слева на сундуке, китап на кровати справа (подсвечивается), эби
      взаимодействуем с китап -> сцена 12

Сцена 12(болтаем):
      Объекты: затемнённый фон сцены 11, крупный китап, текстовое окно ("Китап")
      взаимодействуем с текстом -> сцена 14

Сцена 13(ходим):
      Объекты: интерьер дома, дверь слева сверху, самавыр слева на сундуке, эби
      взаимодействуем с дверью -> сцена 15

Сцена 14(болтаем):
      Объекты: затемнённый фон сцены 13, большая эби слева, текстовое окно ("Миңа су алып кил әле")
      взаимодействуем с текстом -> сцена 13

Сцена 15(ходим):
      Объекты: двор с домом, колодец слева, чиләк с су справа от бабая (подсвечивается), дверь в дом, бабай
      взаимодействуем с чиләк -> сцена 16

Сцена 16(болтаем):
      Объекты: затемнённый фон сцены 15, большой чиләк, текстовое окно ("Су")
      взаимодействуем с текстом -> сцена 15

Сцена 17(ходим):
      Объекты: интерьер дома, дверь слева сверху, самавыр слева на сундуке, чиләк с водой, эби (подсвечивается)
      взаимодействуем с эби -> сцена 18

Сцена 18(болтаем):
    Объекты: затемнённый фон сцены 17, самавыр слева на сундуке, большая эби слева, текстовое окно ("Рәхмәт! Хәзер чәй эчәбез")
    взаимодействуем с текстом -> сцена 17
      
