Сюжет игры Чәчәк Quest:

Сцена 1(ходим):
      Объекты: фон, дома, бабай(подсвечивается), эби, цветок
      взаимодействуем с бабаем -> сцена 2

Сцена 2(болтаем):
      Объекты: объекты сцены 1 на фоне(затемнено), большой бабай слева, текстовое окно ("Сәлам!")
      взаимодействуем с текстовым окном -> сцена 3

Сцена 3(ходим):
      Объекты: фон, дома, бабай, эби(подсвечивается), цветок
      взаимодействуем с эби -> сцена 4

Сцена 4(болтаем):
      Объекты: объекты сцены 3 на фоне(затемнено), большая эби слева, текстовое окно ("Исәнмесез, бир миңа чәчәк")
      взаимодействуем с текстовым окном -> сцена 5

Сцена 5(ходим):
      Объекты: фон, дома, бабай, эби, цветок(подсвечивается)
      взаимодействуем с цветок -> сцена 6

Сцена 6(болатем):
      Объекты: объекты сцены 5 на фоне(затемнено), большой цветок, текстовое окно ("Чәчәк")
      взаимодействуем с текстовым окном -> сцена 7

Сцена 7(ходим):
      Объекты: фон, дома, бабай, эби(подсвечивается), цветок
      взаимодействуем с эби -> сцена 8

Сцена 8(болтаем):
    Объекты: объекты сцены 7 на фоне(затемнено), большая эби слева, текстовое окно ("Рәхмәт")
    взаимодействуем с текстовым окном -> конец
      
